[{"bill_id": "hr4385-118", "title": "To extend authorization of the Reclamation States Emergency Drought Relief Act of 1991.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4385/text"}, {"bill_id": "hr5764-118", "title": "To amend the Food Security Act of 1985 to increase payments for drought-resilient or water-saving practices and to provide additional payments for perennial production systems, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5764/text"}, {"bill_id": "hr5691-118", "title": "To improve drought related disaster assistance programs of the Department of Agriculture, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5691/text"}, {"bill_id": "hr4382-118", "title": "To require the Secretary of Agriculture to conduct a study on the accessibility of addiction and mental health care providers and services for farmers and ranchers who have been impacted by severe and persistent drought, extreme weather events, instability in the commodities market, misinformation targeting consumers, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4382/text"}, {"bill_id": "hr4290-118", "title": "To amend the Federal Agriculture Improvement and Reform Act of 1996 to ensure that producers who rely on acequia systems have access to drought protections, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4290/text"}, {"bill_id": "s2643-118", "title": "A bill to amend the Federal Crop Insurance Act to modify eligibility for prevented planting insurance under certain drought conditions, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/2643/text"}, {"bill_id": "s2706-118", "title": "A bill to amend the National Agricultural Research, Extension, and Teaching Policy Act of 1977 to require the Secretary of Agriculture to enter into cooperative agreements relating to drought prevention, preparedness, response, and mitigation, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/2706/text"}, {"bill_id": "s2102-118", "title": "A bill to provide for drought preparedness and improved water supply reliability.", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/2102/text"}, {"bill_id": "s2166-118", "title": "A bill to amend the Reclamation States Emergency Drought Relief Act of 1991 and the Omnibus Public Land Management Act of 2009 to provide grants to States and Indian Tribes for programs to voluntarily repurpose agricultural land to reduce consumptive water use, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/2166/text"}, {"bill_id": "hr4373-118", "title": "To reauthorize the National Integrated Drought Information System, maintain a National Coordinated Soil Moisture Monitoring Network, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4373/text"}, {"bill_id": "s2077-118", "title": "A bill to amend the Federal Agriculture Improvement and Reform Act of 1996 to ensure that producers who rely on acequia systems have access to drought protections, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/2077/text"}, {"bill_id": "hr215-118", "title": "To provide long-term water supply and regulatory reliability to drought-stricken California, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/215/text"}, {"bill_id": "hr4690-117", "title": "To reauthorize and amend the Magnuson-Stevens Fishery Conservation and Management Act, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/4690/text"}, {"bill_id": "hr3764-117", "title": "To direct the Administrator of the National Oceanic and Atmospheric Administration to provide for ocean-based climate solutions to reduce carbon emissions and global warming; to make coastal communities more resilient; and to provide for the conservation and restoration of ocean and coastal habitats, biodiversity, and marine mammal and fish populations; and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3764/text"}, {"bill_id": "hr3524-117", "title": "To revitalize and reassert United States leadership, investment, and engagement in the Indo-Pacific region and globally.", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3524/text"}, {"bill_id": "s558-117", "title": "A bill to establish a national integrated flood information system within the National Oceanic and Atmospheric Administration, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/558/text"}, {"bill_id": "hr7776-117", "title": "To provide for improvements to the rivers and harbors of the United States, to provide for the conservation and development of water and related resources, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/7776/text"}, {"bill_id": "s3531-117", "title": "A bill to require the Federal Government to produce a national climate adaptation and resilience strategy, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/3531/text"}, {"bill_id": "s4579-117", "title": "A bill to amend the Energy and Water Development and Related Agencies Appropriations Act, 2015, to extend certain deadlines applicable to pilot projects to increase Colorado River System water to address effects of historic drought conditions, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/4579/text"}, {"bill_id": "hr2872-117", "title": "To establish an integrated national approach to respond to ongoing and expected effects of extreme weather and climate change by protecting, managing, and conserving the fish, wildlife, and plants of the United States, and to maximize Government efficiency and reduce costs, in cooperation with State, local, and Tribal Governments and other entities, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/2872/text"}]