[{"bill_id": "hres726-118", "title": "Supporting the designation of the week of September 25 through September 29, 2023, as \"National Clean Energy Week\".", "full_text": "https://www.congress.gov/bill/118th-congress/house-resolution/726/text"}, {"bill_id": "hr5468-118", "title": "To amend the Social Security Act, the Food and Nutrition Act of 2008, and the Low-Income Home Energy Assistance Act of 1981 to require that the value of children's savings accounts be disregarded for the purpose of determining eligibility to receive certain benefits under such Acts, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5468/text"}, {"bill_id": "hr5482-118", "title": "To prevent energy poverty and ensure that at-risk communities have access to affordable energy.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5482/text"}, {"bill_id": "hr5718-118", "title": "To require the Secretary of Energy to establish a Nuclear Fuel Security Program, expand the American Assured Fuel Supply Program, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5718/text"}, {"bill_id": "hr5723-118", "title": "To require the Secretary of Agriculture to provide information and education tools to farmers on the cost savings, energy savings, water conservation, and carbon emissions reductions that can be realized through the use of energy-efficient pumping systems, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5723/text"}, {"bill_id": "hr5051-118", "title": "To amend the Farm Security and Rural Investment Act of 2002 to improve the Rural Energy for America Program, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5051/text"}, {"bill_id": "hr5191-118", "title": "To direct the Secretary of Agriculture to establish a renewable energy grant program for territories of the United States, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5191/text"}, {"bill_id": "hr5246-118", "title": "To amend the Food, Conservation, and Energy Act of 2008 to reauthorize the Farm and Ranch Stress Assistance Network and establish a national agricultural crisis hotline, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5246/text"}, {"bill_id": "hr4824-118", "title": "To amend the Energy Policy Act of 2005 to require the Secretary of Energy to carry out terrestrial carbon sequestration research and development activities, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4824/text"}, {"bill_id": "hr4877-118", "title": "To amend the Energy Policy Act of 2005 to direct the Secretary of Energy to carry out a research, development, and demonstration program with respect to abandoned wells, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4877/text"}, {"bill_id": "hr5637-118", "title": "To amend the Food, Conservation, and Energy Act of 2008 to authorize the Secretary of Agriculture to authorize the use of certain grants to deliver peer-to-peer mental health support to individuals who are engaged in farming, ranching, farm work, and other occupations relating to agriculture.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5637/text"}, {"bill_id": "hr2980-118", "title": "To provide for Department of Energy and National Science Foundation research and development coordination, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/2980/text"}, {"bill_id": "hr5618-118", "title": "To direct the Secretary of the Treasury to issue Clean Energy Victory Bonds.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5618/text"}, {"bill_id": "s2898-118", "title": "A bill to amend the Food, Conservation, and Energy Act of 2008 to authorize the Secretary of Agriculture to authorize the use of certain grants to deliver peer-to-peer mental health support to individuals who are engaged in farming, ranching, farm work, and other occupations relating to agriculture.", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/2898/text"}, {"bill_id": "hr5654-118", "title": "To require the Secretary of Energy to withdraw a proposed rule relating to energy conservation standards for consumer water heaters.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5654/text"}, {"bill_id": "s912-118", "title": "A bill to require the Secretary of Energy to provide technology grants to strengthen domestic mining education, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/912/text"}, {"bill_id": "hjres91-118", "title": "Providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Energy relating to the \"Energy Conservation Program: Test Procedure for Consumer Water Heaters and Residential-Duty Commercial Water Heaters\".", "full_text": "https://www.congress.gov/bill/118th-congress/house-joint-resolution/91/text"}, {"bill_id": "s2893-118", "title": "A bill to direct the Secretary of the Treasury to issue Clean Energy Victory Bonds.", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/2893/text"}, {"bill_id": "s2827-118", "title": "A bill to require the Federal Energy Regulatory Commission to establish minimum interregional transfer capabilities, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/2827/text"}, {"bill_id": "hr5551-118", "title": "To require the Federal Energy Regulatory Commission to establish minimum interregional transfer capabilities, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5551/text"}]