[{"bill_id": "sres392-118", "title": "A resolution recognizing and honoring the first responders and those who lost their lives in the Maui wildfires in August 2023 that affected thousands of people.", "full_text": "https://www.congress.gov/bill/118th-congress/senate-resolution/392/text"}, {"bill_id": "hres752-118", "title": "Recognizing and honoring the first responders and those who lost their lives in the Maui wildfires in August 2023 that affected thousands of people.", "full_text": "https://www.congress.gov/bill/118th-congress/house-resolution/752/text"}, {"bill_id": "hr4970-118", "title": "To provide an exclusion from gross income for compensation for expenses and losses resulting from certain wildfires.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4970/text"}, {"bill_id": "hr1242-118", "title": "To make improvements to the role of the Department of Defense in responding to domestic emergencies, including wildfires.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/1242/text"}, {"bill_id": "s1764-118", "title": "A bill to improve Federal activities relating to wildfires, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/1764/text"}, {"bill_id": "hr3615-118", "title": "To direct the Secretary of Energy to carry out a demonstration program for projects that improve electric grid resilience with respect to wildfires, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/3615/text"}, {"bill_id": "hr482-118", "title": "To improve Federal activities relating to wildfires, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/482/text"}, {"bill_id": "hr887-118", "title": "To authorize local educational agencies and non-public schools to use funds, services, or assistance provided under section 2001 or 2002 of the American Rescue Plan Act of 2021 for school safety, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/887/text"}, {"bill_id": "hr481-118", "title": "To authorize transitional sheltering assistance for individuals who live in areas with unhealthy air quality caused by wildfires, and for other purposes.", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/481/text"}, {"bill_id": "hr3764-117", "title": "To direct the Administrator of the National Oceanic and Atmospheric Administration to provide for ocean-based climate solutions to reduce carbon emissions and global warming; to make coastal communities more resilient; and to provide for the conservation and restoration of ocean and coastal habitats, biodiversity, and marine mammal and fish populations; and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3764/text"}, {"bill_id": "hr3524-117", "title": "To revitalize and reassert United States leadership, investment, and engagement in the Indo-Pacific region and globally.", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3524/text"}, {"bill_id": "s558-117", "title": "A bill to establish a national integrated flood information system within the National Oceanic and Atmospheric Administration, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/558/text"}, {"bill_id": "s3092-117", "title": "A bill to amend the Robert T. Stafford Disaster Relief and Emergency Assistance Act to improve the provision of certain disaster assistance, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/3092/text"}, {"bill_id": "s4237-117", "title": "A bill to establish and maintain a coordinated program within the National Oceanic and Atmospheric Administration that improves wildfire, fire weather, fire risk, and smoke related forecasting, detection, modeling, observations, and service delivery, and to address growing needs in the wildland-urban interface, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/4237/text"}, {"bill_id": "hr2872-117", "title": "To establish an integrated national approach to respond to ongoing and expected effects of extreme weather and climate change by protecting, managing, and conserving the fish, wildlife, and plants of the United States, and to maximize Government efficiency and reduce costs, in cooperation with State, local, and Tribal Governments and other entities, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/2872/text"}, {"bill_id": "hr6492-117", "title": "To establish a climate resilience workforce, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/6492/text"}, {"bill_id": "hr7965-117", "title": "To prevent the misuse of drones, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/7965/text"}, {"bill_id": "hr7900-117", "title": "To authorize appropriations for fiscal year 2023 for military activities of the Department of Defense and for military construction, to prescribe military personnel strengths for such fiscal year, and for other purposes.", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/7900/text"}, {"bill_id": "s4729-117", "title": "A bill to amend the Agricultural Credit Act of 1978 to waive the cost share requirement under the emergency forest restoration program for land damaged by the Hermit's Peak/Calf Canyon Fire.", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/4729/text"}, {"bill_id": "s4935-117", "title": "A bill to require the Secretary of the Interior and the Secretary of Agriculture to implement measures to better prepare for and more quickly respond to wildfires on certain public land and in certain National Forests.", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/4935/text"}]