[{"bill_id": "hr5022-118", "title": "To place a moratorium on the issuance and renewal of certain Federal authorizations for mountaintop removal coal mining until a health study is conducted, and for other purposes.", "short_title": "ACHE Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5022/text"}, {"bill_id": "hr4888-118", "title": "To require certain insurance companies to disclose investments and underwriting that relate to coal mining and oil and gas extraction and fossil fuel extraction, and for other purposes.", "short_title": "Polluter Portfolio Disclosure Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4888/text"}, {"bill_id": "s1089-118", "title": "A bill to maintain the Natural Coal Council in the Department of Energy to provide advice and recommendations to the Secretary of Energy on matters relating to coal and the coal industry, and for other purposes.", "short_title": "Coal Council Certainty Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/1089/text"}, {"bill_id": "hr1335-118", "title": "To restart onshore and offshore oil, gas, and coal leasing, streamline permitting for energy infrastructure, ensure transparency in energy development on Federal lands, and for other purposes.", "short_title": "Transparency, Accountability, Permitting, and Production of American Resources Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/1335/text"}, {"bill_id": "hr1457-118", "title": "To require the Secretary of the Interior to take certain actions with respect to certain qualified coal applications, and for other purposes.", "short_title": "COAL Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/1457/text"}, {"bill_id": "hr2021-117", "title": "To restore, reaffirm, and reconcile environmental justice and civil rights, and for other purposes.", "short_title": "Environmental Justice For All Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/2021/text"}, {"bill_id": "hr3764-117", "title": "To direct the Administrator of the National Oceanic and Atmospheric Administration to provide for ocean-based climate solutions to reduce carbon emissions and global warming; to make coastal communities more resilient; and to provide for the conservation and restoration of ocean and coastal habitats, biodiversity, and marine mammal and fish populations; and for other purposes.", "short_title": "Ocean-Based Climate Solutions Act of 2022", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3764/text"}, {"bill_id": "hr3524-117", "title": "To revitalize and reassert United States leadership, investment, and engagement in the Indo-Pacific region and globally.", "short_title": "Ensuring American Global Leadership and Engagement Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3524/text"}, {"bill_id": "hr6102-117", "title": "To ensure that claims for benefits under the Black Lung Benefits Act are processed in a fair and timely manner, to better protect miners from pneumoconiosis (commonly known as \"black lung disease\"), and for other purposes.", "short_title": "Black Lung Benefits Improvement Act of 2022", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/6102/text"}, {"bill_id": "hr6611-117", "title": "To authorize the Embassy of France in Washington, DC, to establish a commemorative work in the District of Columbia and its environs to honor the extraordinary contributions of Jean Monnet to restoring peace between European nations and establishing the European Union, and for other purposes.", "short_title": "To authorize the Government of France to establish a commemorative work in the District of Columbia and its environs to honor the extraordinary contributions of Jean Monnet to restoring peace between European nations and establishing the European Union, a", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/6611/text"}, {"bill_id": "hr1517-117", "title": "To amend the Mineral Leasing Act to make certain adjustments to the fiscal terms for fossil fuel development and to make other reforms to improve returns to taxpayers for the development of Federal energy resources, and for other purposes.", "short_title": "Ending Taxpayer Welfare for Oil and Gas Companies Act of 2021", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/1517/text"}, {"bill_id": "hr1506-117", "title": "To provide for the accurate reporting of fossil fuel extraction and emissions by entities with leases on public land, and for other purposes.", "short_title": "Transparency in Energy Production Act of 2021", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/1506/text"}, {"bill_id": "s4420-117", "title": "A bill to provide for advancements in carbon removal research, quantification, and commercialization, including by harnessing natural processes, and for other purposes.", "short_title": "CREST Act of 2022", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/4420/text"}, {"bill_id": "s3915-117", "title": "A bill to require the Secretary of Energy to provide technology grants to strengthen domestic mining education, and for other purposes.", "short_title": "Mining Schools Act of 2022", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/3915/text"}, {"bill_id": "hr1733-117", "title": "To amend the Surface Mining Control and Reclamation Act of 1977 to provide funds to States and Indian tribes for the purpose of promoting economic revitalization, diversification, and development in economically distressed communities through the reclamation and restoration of land and water resources adversely affected by coal mining carried out before August 3, 1977, and for other purposes.", "short_title": "RECLAIM Act of 2021", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/1733/text"}, {"bill_id": "hr4080-117", "title": "To impose additional duties on imports of goods from the People's Republic of China until China provides full compensation and reimbursement relating to the COVID-19 pandemic to the United States, and for other purposes.", "short_title": "China COVID–19 Restitution Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/4080/text"}, {"bill_id": "hr6470-117", "title": "To counter the aggression of the Russian Federation against Ukraine and Eastern European allies, to expedite security assistance to Ukraine to bolster Ukraine's defense capabilities, and to impose sanctions relating to the actions of the Russian Federation with respect to Ukraine, and for other purposes.", "short_title": "Defending Ukraine Sovereignty Act of 2022", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/6470/text"}, {"bill_id": "hres702-117", "title": "Expressing the sense of the House of Representatives that the Justices of the Supreme Court should make themselves subject to the existing and operative ethics guidelines set out in the Code of Conduct for United States Judges, or should promulgate their own code of conduct.", "short_title": "Expressing the sense of the House of Representatives that the Justices of the Supreme Court should make themselves subject to the existing and operative ethics guidelines set out in the Code of Conduct for United States Judges, or should promulgate their ", "full_text": "https://www.congress.gov/bill/117th-congress/house-resolution/702/text"}, {"bill_id": "hr6742-117", "title": "To counter the aggression of the Russian Federation against Ukraine and Eastern European allies, to expedite security assistance to Ukraine, to bolster its defense capabilities and those of allies and partners in the region, to impose sanctions relating to the actions of the Russian Federation with respect to Ukraine, and for other purposes.", "short_title": "Never Yielding Europe’s Territory (NYET) Act of 2022", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/6742/text"}]