[{"bill_id": "hr1449-118", "title": "To amend the Geothermal Steam Act of 1970 to increase the frequency of lease sales, to require replacement sales, and for other purposes.", "short_title": "CLEAN Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/1449/text"}, {"bill_id": "hr5004-118", "title": "To withdraw certain land located in Curry County and Josephine County, Oregon, from all forms of entry, appropriation, or disposal under the public land laws, location, entry, and patent under the mining laws, and operation under the mineral leasing and geothermal leasing laws, and for other purposes.", "short_title": "Southwestern Oregon Watershed and Salmon Protection Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5004/text"}, {"bill_id": "hr4777-118", "title": "To require regulation of wastes associated with the exploration, development, or production of crude oil, natural gas, or geothermal energy under the Solid Waste Disposal Act, and for other purposes.", "short_title": "Closing Loopholes and Ending Arbitrary and Needless Evasion of Regulations Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4777/text"}, {"bill_id": "hconres34-118", "title": "Expressing disapproval of the withdrawal by the Secretary of the Interior of approximately 225,504 acres of National Forest System lands in Cook, Lake, and Saint Louis Counties, Minnesota, from disposition under the United States mineral and geothermal leasing laws.", "short_title": "Expressing disapproval of the withdrawal by the Secretary of the Interior of approximately 225,504 acres of National Forest System lands in Cook, Lake, and Saint Louis Counties, Minnesota, from disposition under the United States mineral and geothermal le", "full_text": "https://www.congress.gov/bill/118th-congress/house-concurrent-resolution/34/text"}, {"bill_id": "s505-118", "title": "A bill to amend section 212(d)(5) of the Immigration and Nationality Act to reform immigration parole, and for other purposes.", "short_title": "Immigration Parole Reform Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/505/text"}, {"bill_id": "hr2780-117", "title": "To provide for climate change planning, mitigation, adaptation, and resilience in the United States Territories and Freely Associated States, and for other purposes.", "short_title": "Insular Area Climate Change Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/2780/text"}, {"bill_id": "hr3524-117", "title": "To revitalize and reassert United States leadership, investment, and engagement in the Indo-Pacific region and globally.", "short_title": "Ensuring American Global Leadership and Engagement Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3524/text"}, {"bill_id": "s3129-117", "title": "A bill to amend the Wild and Scenic Rivers Act to designate certain segments of the Gila River system in the State of New Mexico as components of the National Wild and Scenic Rivers System, to provide for the transfer of administrative jurisdiction over certain Federal land in the State of New Mexico, and for other purposes.", "short_title": "M.H. Dutch Salmon Greater Gila Wild and Scenic River Act", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/3129/text"}, {"bill_id": "hr2794-117", "title": "To provide for the protection of the Boundary Waters Canoe Area Wilderness and interconnected Federal lands and waters, including Voyageurs National Park, within the Rainy River Watershed in the State of Minnesota, and for other purposes.", "short_title": "Boundary Waters Wilderness Protection and Pollution Prevention Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/2794/text"}, {"bill_id": "hr1517-117", "title": "To amend the Mineral Leasing Act to make certain adjustments to the fiscal terms for fossil fuel development and to make other reforms to improve returns to taxpayers for the development of Federal energy resources, and for other purposes.", "short_title": "Ending Taxpayer Welfare for Oil and Gas Companies Act of 2021", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/1517/text"}, {"bill_id": "hr3326-117", "title": "To promote the development of renewable energy on public lands, and for other purposes.", "short_title": "Public Land Renewable Energy Development Act of 2021", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3326/text"}, {"bill_id": "hr1506-117", "title": "To provide for the accurate reporting of fossil fuel extraction and emissions by entities with leases on public land, and for other purposes.", "short_title": "Transparency in Energy Production Act of 2021", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/1506/text"}, {"bill_id": "hr1884-117", "title": "To repeal section 3003 of the Carl Levin and Howard P. \"Buck\" McKeon National Defense Authorization Act for Fiscal Year 2015, and for other purposes.", "short_title": "Save Oak Flat Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/1884/text"}, {"bill_id": "s4542-117", "title": "A bill to establish the Dolores River National Conservation Area and the Dolores River Special Management Area in the State of Colorado, to protect private water rights in the State, and for other purposes.", "short_title": "Dolores River National Conservation Area and Special Management Area Act", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/4542/text"}, {"bill_id": "hr3772-117", "title": "To address root causes of homelessness, meet the needs of community members experiencing harms from homelessness, transition communities towards providing housing for all, end penalization of homelessness, and ensure full democratic participation and inclusion of persons experiencing homelessness, and for other purposes.", "short_title": "Housing Is a Human Right Act of 2021", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3772/text"}, {"bill_id": "hr7900-117", "title": "To authorize appropriations for fiscal year 2023 for military activities of the Department of Defense and for military construction, to prescribe military personnel strengths for such fiscal year, and for other purposes.", "short_title": "National Defense Authorization Act for Fiscal Year 2023", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/7900/text"}, {"bill_id": "hr4270-117", "title": "To amend the Energy Policy Act of 2005 to direct the Secretary of Energy to carry out a research, development, and demonstration program with respect to abandoned wells, and for other purposes.", "short_title": "Abandoned Well Remediation Research and Development Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/4270/text"}, {"bill_id": "hr8802-117", "title": "To require the Secretary of the Interior and the Chief of the Forest Service to align management of public lands and waters with the President's greenhouse gas emission reduction goals, and for other purposes.", "short_title": "Public Lands and Waters Climate Leadership Act of 2022", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/8802/text"}, {"bill_id": "s1321-117", "title": "A bill to modify the boundary of the Casa Grande Ruins National Monument, and for other purposes.", "short_title": "Casa Grande Ruins National Monument Boundary Modification Act of 2021", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/1321/text"}]
