[{"bill_id": "s3053-118", "title": "A bill to prohibit the importation of crude oil, petroleum, petroleum products, and liquefied natural gas from Venezuela and Iran.", "short_title": "Preempting Misguided Appeasement and Financing of Destabilizing Regimes Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/3053/text"}, {"bill_id": "s2986-118", "title": "A bill to prohibit the issuance of an interim or final rule, and to prohibit the inclusion in certain oil and gas leases, exploration or development plans, or well permits requirements or recommendations, that establish a vessel speed or operational restriction in the Central or Western Planning Area of the Gulf of Mexico of the outer Continental Shelf until the Secretary of the Interior and the Secretary of Commerce complete a study demonstrating that proposed mitigation efforts would have no negative impact on supply chains, United States offshore energy production and generation, military activities, including readiness, and United States commercial and recreational fishing maritime commerce, and for other purposes.", "short_title": "WHALE Act", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/2986/text"}, {"bill_id": "hr5792-118", "title": "To provide whistleblower protections to certain workers in the offshore oil and gas industry.", "short_title": "Offshore Oil and Gas Worker Whistleblower Protection Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5792/text"}, {"bill_id": "hr5373-118", "title": "To amend the Federal Water Pollution Control Act to increase the civil and criminal penalties for oil spills, and for other purposes.", "short_title": "Increasing Penalties for Offshore Polluters Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/5373/text"}, {"bill_id": "hr4825-118", "title": "To require the imposition of sanctions and other measures relating to the Russian oil price cap policy, and for other purposes.", "short_title": "No Illegal Oil from Russia Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4825/text"}, {"bill_id": "hr4888-118", "title": "To require certain insurance companies to disclose investments and underwriting that relate to coal mining and oil and gas extraction and fossil fuel extraction, and for other purposes.", "short_title": "Polluter Portfolio Disclosure Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4888/text"}, {"bill_id": "hr4778-118", "title": "To amend the Federal Water Pollution Control Act and direct the Secretary of the Interior to conduct a study with respect to stormwater runoff from oil and gas operations, and for other purposes.", "short_title": "FRESHER Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4778/text"}, {"bill_id": "hr4782-118", "title": "To amend the Clean Air Act to eliminate the exemption for aggregation of emissions from oil and gas sources, and for other purposes.", "short_title": "CLOSE Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4782/text"}, {"bill_id": "hr4777-118", "title": "To require regulation of wastes associated with the exploration, development, or production of crude oil, natural gas, or geothermal energy under the Solid Waste Disposal Act, and for other purposes.", "short_title": "Closing Loopholes and Ending Arbitrary and Needless Evasion of Regulations Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4777/text"}, {"bill_id": "s1622-118", "title": "A bill to discourage speculative oil and gas leasing and to promote enhanced multiple use management of public land and National Forest System land, and for other purposes.", "short_title": "End Speculative Oil and Gas Leasing Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/1622/text"}, {"bill_id": "s535-118", "title": "A bill to streamline the oil and gas permitting process and to recognize fee ownership for certain oil and gas drilling or spacing units, and for other purposes.", "short_title": "Bureau of Land Management Mineral Spacing Act", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/535/text"}, {"bill_id": "hr4301-118", "title": "To amend the Mineral Leasing Act to make certain adjustments to the regulation of surface-disturbing activities and to protect taxpayers from unduly bearing the reclamation costs of oil and gas development, and for other purposes.", "short_title": "Bonding Reform and Taxpayer Protection Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4301/text"}, {"bill_id": "hr4072-118", "title": "To direct the Administrator of the Environmental Protection Agency to conduct a measurement-based national methane research pilot study to quantify methane emissions from certain oil and gas infrastructure, and for other purposes.", "short_title": "Methane Emissions Research Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4072/text"}, {"bill_id": "s1947-118", "title": "A bill to direct the Administrator of the Environmental Protection Agency to conduct a measurement-based national methane research pilot study to quantify methane emissions from certain oil and gas infrastructure, and for other purposes.", "short_title": "Methane Emissions Research Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/1947/text"}, {"bill_id": "hr4030-118", "title": "To amend the Outer Continental Shelf Lands Act to prohibit oil and gas leasing in certain areas of the Outer Continental Shelf.", "short_title": "North Pacific Ocean Protection Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4030/text"}, {"bill_id": "hr3978-118", "title": "To amend the Outer Continental Shelf Lands Act to prohibit oil and gas leasing in the Southern California planning area.", "short_title": "Southern California Coast and Ocean Protection Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/3978/text"}, {"bill_id": "hr3488-118", "title": "To amend the Energy Policy and Conservation Act to reinstate the ban on the export of crude oil and natural gas produced in the United States, and for other purposes.", "short_title": "BAN Fossil Fuel Exports Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/3488/text"}, {"bill_id": "s1707-118", "title": "A bill to amend the Energy Policy and Conservation Act to reinstate the ban on the export of crude oil and natural gas produced in the United States, and for other purposes.", "short_title": "BAN Fossil Fuel Exports Act", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/1707/text"}]
