[{"bill_id": "hr6064-118", "title": "To amend the Federal Land Policy and Management Act of 1976 to provide for the denial of certain applications for solar or wind energy development projects right-of-way applications.", "short_title": "Don’t DO IT Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/6064/text"}, {"bill_id": "s3122-118", "title": "A bill to amend the Federal Land Policy and Management Act of 1976 to provide for the denial of certain applications for solar or wind energy development projects right-of-way applications.", "short_title": "Don’t Develop Obstructive Infrastructure on our Terrain Act", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/3122/text"}, {"bill_id": "s3025-118", "title": "A bill to amend the Inflation Reduction Act of 2022 to repeal restrictions on onshore wind and solar.", "short_title": "CLEAN Energy Act", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/3025/text"}, {"bill_id": "hr4990-118", "title": "To require the Secretary of Energy to carry out a program to provide grants and loans to support and expand the domestic solar component manufacturing supply chain, and for other purposes.", "short_title": "Reclaiming the Solar Supply Chain Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4990/text"}, {"bill_id": "hr4916-118", "title": "To amend the Inflation Reduction Act of 2022 to repeal restrictions on onshore wind and solar.", "short_title": "CLEAN Energy Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4916/text"}, {"bill_id": "s1215-118", "title": "A bill to require assessments of opportunities to install and maintain floating photovoltaic solar panels at Bureau of Reclamation and Corps of Engineers projects, and for other purposes.", "short_title": "POWER Our Reservoirs Act", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/1215/text"}, {"bill_id": "hr4369-118", "title": "To amend the Internal Revenue Code of 1986 to deny the energy credit to property located on prime or unique farmland, as defined by the Secretary of Agriculture in part 657 of title 7, Code of Federal Regulations, if such property is used for generating solar energy.", "short_title": "PANELS Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4369/text"}, {"bill_id": "s1643-118", "title": "A bill to require the Secretary of Energy to carry out a program to provide grants and loans to support and expand the domestic solar component manufacturing supply chain, and for other purposes.", "short_title": "Reclaiming the Solar Supply Chain Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/1643/text"}, {"bill_id": "s1555-118", "title": "A bill to amend the Farm Security and Rural Investment Act of 2002 to support solar projects under the Rural Energy for America Program, and for other purposes.", "short_title": "Pollinator Power Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/1555/text"}, {"bill_id": "hr2751-118", "title": "To require the Secretary of Energy to establish a program to increase participation in community solar programs and the receipt of associated benefits, and for other purposes.", "short_title": "Community Solar Consumer Choice Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/2751/text"}, {"bill_id": "hr2731-118", "title": "To require assessments of opportunities to install and maintain floating photovoltaic solar panels at Bureau of Reclamation and Corps of Engineers projects, and for other purposes.", "short_title": "POWER Our Reservoirs Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/2731/text"}, {"bill_id": "s968-118", "title": "A bill to prohibit the procurement of solar panels manufactured or assembled in the People's Republic of China.", "short_title": "Keep China Out of Solar Energy Act of 2023", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/968/text"}, {"bill_id": "hr2780-117", "title": "To provide for climate change planning, mitigation, adaptation, and resilience in the United States Territories and Freely Associated States, and for other purposes.", "short_title": "Insular Area Climate Change Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/2780/text"}, {"bill_id": "hr3764-117", "title": "To direct the Administrator of the National Oceanic and Atmospheric Administration to provide for ocean-based climate solutions to reduce carbon emissions and global warming; to make coastal communities more resilient; and to provide for the conservation and restoration of ocean and coastal habitats, biodiversity, and marine mammal and fish populations; and for other purposes.", "short_title": "Ocean-Based Climate Solutions Act of 2022", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3764/text"}, {"bill_id": "hr3524-117", "title": "To revitalize and reassert United States leadership, investment, and engagement in the Indo-Pacific region and globally.", "short_title": "Ensuring American Global Leadership and Engagement Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3524/text"}, {"bill_id": "hr3326-117", "title": "To promote the development of renewable energy on public lands, and for other purposes.", "short_title": "Public Land Renewable Energy Development Act of 2021", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3326/text"}, {"bill_id": "hr1506-117", "title": "To provide for the accurate reporting of fossil fuel extraction and emissions by entities with leases on public land, and for other purposes.", "short_title": "Transparency in Energy Production Act of 2021", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/1506/text"}, {"bill_id": "s2510-117", "title": "A bill to reduce the health risks of heat by establishing the National Integrated Heat Health Information System Program within the National Oceanic and Atmospheric Administration and the National Integrated Heat Health Information System Interagency Committee to improve extreme heat preparedness, planning, and response, requiring a study, and establishing financial assistance programs to address heat effects, and for other purposes.", "short_title": "Preventing HEAT Illness and Deaths Act of 2021", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/2510/text"}, {"bill_id": "hr9434-117", "title": "To establish a grant program to incentivize the energy resilience of air carrier airports to acquire or install solar photovoltaic panels, battery storage systems, microgrids, and related electric infrastructure for on-site renewable energy generation and storage, and for other purposes.", "short_title": "Airport Energy Resiliency and Renewable Energy Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/9434/text"}, {"bill_id": "hr9399-117", "title": "To require assessments of opportunities to install and maintain floating photovoltaic solar panels at Corps of Engineers and Bureau of Reclamation projects, and for other purposes.", "short_title": "Protect Our Waters and Expand Renewables on Our Reservoirs Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/9399/text"}]
