[{"bill_id": "hr6064-118", "title": "To amend the Federal Land Policy and Management Act of 1976 to provide for the denial of certain applications for solar or wind energy development projects right-of-way applications.", "short_title": "Don’t DO IT Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/6064/text"}, {"bill_id": "s3122-118", "title": "A bill to amend the Federal Land Policy and Management Act of 1976 to provide for the denial of certain applications for solar or wind energy development projects right-of-way applications.", "short_title": "Don’t Develop Obstructive Infrastructure on our Terrain Act", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/3122/text"}, {"bill_id": "s3026-118", "title": "A bill to amend the Inflation Reduction Act of 2022 to repeal restrictions on offshore wind leasing.", "short_title": "NOW Act", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/3026/text"}, {"bill_id": "s3025-118", "title": "A bill to amend the Inflation Reduction Act of 2022 to repeal restrictions on onshore wind and solar.", "short_title": "CLEAN Energy Act", "full_text": "https://www.congress.gov/bill/118th-congress/senate-bill/3025/text"}, {"bill_id": "hr4916-118", "title": "To amend the Inflation Reduction Act of 2022 to repeal restrictions on onshore wind and solar.", "short_title": "CLEAN Energy Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4916/text"}, {"bill_id": "hr4936-118", "title": "To amend the Inflation Reduction Act of 2022 to repeal restrictions on offshore wind leasing.", "short_title": "NOW Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4936/text"}, {"bill_id": "hr4284-118", "title": "To prohibit commercial offshore wind energy development in Lobster Management Area 1 in the Gulf of Maine, and for other purposes.", "short_title": "Northeast Fisheries Heritage Protection Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4284/text"}, {"bill_id": "hr4151-118", "title": "To amend the Internal Revenue Code of 1986 to require certain contract terms in contracts relating to wind turbines on land not owned by the taxpayer as a requirement in order to claim the credit relating to electricity produced from certain renewable resources.", "short_title": "To amend the Internal Revenue Code of 1986 to require certain contract terms in contracts relating to wind turbines on land not owned by the taxpayer as a requirement in order to claim the credit relating to electricity produced from certain renewable res", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/4151/text"}, {"bill_id": "hr3614-118", "title": "To direct the Comptroller General of the United States to submit to Congress a report on offshore wind development vessels, and for other purposes.", "short_title": "American Offshore Wind Opportunity Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/3614/text"}, {"bill_id": "hr2716-118", "title": "To distribute revenue from offshore wind projects in the New York Bight Area to certain coastal States, and promote conservation and workforce development.", "short_title": "OWNER Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/2716/text"}, {"bill_id": "hres239-118", "title": "Expressing the sense of the House of Representatives that offshore wind projects along the Atlantic coast require more comprehensive investigations examining the impact to the environment, relevant maritime industries, and national defense before being leased or constructed.", "short_title": "Expressing the sense of the House of Representatives that offshore wind projects along the Atlantic coast require more comprehensive investigations examining the impact to the environment, relevant maritime industries, and national defense before being le", "full_text": "https://www.congress.gov/bill/118th-congress/house-resolution/239/text"}, {"bill_id": "hr982-118", "title": "To address the health needs of incarcerated women related to pregnancy and childbirth, and for other purposes.", "short_title": "Pregnant Women in Custody Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/982/text"}, {"bill_id": "hr426-118", "title": "To amend the Internal Revenue Code of 1986 to end the investment tax credit for offshore wind facilities in the inland navigable waters of the United States.", "short_title": "Lakes Before Turbines Act", "full_text": "https://www.congress.gov/bill/118th-congress/house-bill/426/text"}, {"bill_id": "hr4690-117", "title": "To reauthorize and amend the Magnuson-Stevens Fishery Conservation and Management Act, and for other purposes.", "short_title": "Sustaining America’s Fisheries for the Future Act of 2022", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/4690/text"}, {"bill_id": "hr2780-117", "title": "To provide for climate change planning, mitigation, adaptation, and resilience in the United States Territories and Freely Associated States, and for other purposes.", "short_title": "Insular Area Climate Change Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/2780/text"}, {"bill_id": "hr3764-117", "title": "To direct the Administrator of the National Oceanic and Atmospheric Administration to provide for ocean-based climate solutions to reduce carbon emissions and global warming; to make coastal communities more resilient; and to provide for the conservation and restoration of ocean and coastal habitats, biodiversity, and marine mammal and fish populations; and for other purposes.", "short_title": "Ocean-Based Climate Solutions Act of 2022", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3764/text"}, {"bill_id": "hr3524-117", "title": "To revitalize and reassert United States leadership, investment, and engagement in the Indo-Pacific region and globally.", "short_title": "Ensuring American Global Leadership and Engagement Act", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/3524/text"}, {"bill_id": "hr7776-117", "title": "To provide for improvements to the rivers and harbors of the United States, to provide for the conservation and development of water and related resources, and for other purposes.", "short_title": "James M. Inhofe National Defense Authorization Act for Fiscal Year 2023", "full_text": "https://www.congress.gov/bill/117th-congress/house-bill/7776/text"}, {"bill_id": "s4237-117", "title": "A bill to establish and maintain a coordinated program within the National Oceanic and Atmospheric Administration that improves wildfire, fire weather, fire risk, and smoke related forecasting, detection, modeling, observations, and service delivery, and to address growing needs in the wildland-urban interface, and for other purposes.", "short_title": "Fire Ready Nation Act of 2022", "full_text": "https://www.congress.gov/bill/117th-congress/senate-bill/4237/text"}]
