{"hr1449-118": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the Geothermal Steam Act of 1970. This bill would increase the frequency of lease sales, require replacement sales, and make other important changes to the law.\n\nGeothermal energy is a clean, renewable source of energy that can help us reduce our dependence on fossil fuels. The United States has a great potential for geothermal development, but we need to make sure that we are taking advantage of this opportunity.\n\nThe Geothermal Steam Act of 1970 was a landmark piece of legislation that helped to promote the development of geothermal energy in the United States. However, the law has not been updated in many years, and it is time for us to make some changes.\n\nThe bill would increase the frequency of lease sales, which would help to make geothermal energy more accessible to developers. It would also require replacement sales, which would help to ensure that we are not leaving behind valuable geothermal resources.\n\nThe bill would also make other important changes to the law, such as clarifying the process for leasing geothermal resources on federal lands.\n\nI urge you to support the Geothermal Steam Act of 1970. This bill would help to promote the development of geothermal energy in the United States and help us reduce our dependence on fossil fuels.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]", "hr5004-118": "Dear [Name of Member of Congress],\n\nI am writing to express my support for H.R. [bill number], a bill to withdraw certain land located in Curry County and Josephine County, Oregon, from all forms of entry, appropriation, or disposal under the public land laws, location, entry, and patent under the mining laws, and operation under the mineral leasing and geothermal leasing laws, and for other purposes.\n\nI have been a resident of Curry County for over 20 years, and I have seen firsthand the devastating effects that mining has had on our community. Mining has polluted our water, destroyed our forests, and displaced our wildlife. I believe that it is time to protect these lands from further damage.\n\nThe lands that would be withdrawn by H.R. [bill number] are home to a variety of important natural resources, including old-growth forests, salmon and steelhead fisheries, and wildlife habitat. These lands are also of great cultural and spiritual significance to the Native American tribes that have lived in the area for centuries.\n\nI urge you to support H.R. [bill number] and help to protect these important lands for future generations.\n\nSincerely,\n[Your Name]", "hr4777-118": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the bill to require regulation of wastes associated with the exploration, development, or production of crude oil, natural gas, or geothermal energy under the Solid Waste Disposal Act.\n\nThe exploration, development, and production of crude oil, natural gas, and geothermal energy can generate a variety of wastes, including drilling fluids, produced water, and other hazardous materials. These wastes can pose a serious threat to human health and the environment if they are not properly managed.\n\nThe Solid Waste Disposal Act is a comprehensive law that regulates the disposal of solid waste, including hazardous waste. This law provides a strong framework for regulating wastes associated with the exploration, development, and production of crude oil, natural gas, and geothermal energy.\n\nI urge you to support this bill and help to ensure that these wastes are properly managed to protect human health and the environment.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]", "hconres34-118": "To express disapproval of the withdrawal by the Secretary of the Interior of approximately 225,504 acres of National Forest System lands in Cook, Lake, and Saint Louis Counties, Minnesota, from disposition under the United States mineral and geothermal leasing laws.\n\nWhereas, on February 25, 2023, the Secretary of the Interior withdrew approximately 225,504 acres of National Forest System lands in Cook, Lake, and Saint Louis Counties, Minnesota, from disposition under the United States mineral and geothermal leasing laws;\n\nWhereas, the withdrawal of these lands from mineral and geothermal leasing would prevent the development of critical minerals and energy resources that are essential to the United States economy and national security;\n\nWhereas, the withdrawal of these lands would also prevent the creation of jobs and economic development in Minnesota and the surrounding region;\n\nNow, therefore, be it resolved by the Senate and House of Representatives of the United States of America in Congress assembled,\n\nSection 1. Disapproval of withdrawal.\n\nThe withdrawal of approximately 225,504 acres of National Forest System lands in Cook, Lake, and Saint Louis Counties, Minnesota, from disposition under the United States mineral and geothermal leasing laws is hereby disapproved.\n\nSec. 2. Authorization of appropriations.\n\nThere are authorized to be appropriated such sums as may be necessary to carry out this resolution.", "s505-118": "Dear [Name of Member of Congress],\n\nI am writing to you today to express my support for the bill to amend section 212(d)(5) of the Immigration and Nationality Act to reform immigration parole, and for other purposes.\n\nI believe that this bill is a step in the right direction to reform our immigration system. It would allow for more flexibility in the parole process, which would help to reunite families and keep families together. It would also make it easier for immigrants to come to the United States to work and contribute to our economy.\n\nI urge you to support this bill and help to make it a law.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]", "hr2780-117": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the [Title of Bill]. This bill would provide much-needed funding and resources for climate change planning, mitigation, adaptation, and resilience in the United States Territories and Freely Associated States.\n\nThe United States Territories and Freely Associated States are particularly vulnerable to the impacts of climate change, due to their geographic location, small size, and limited resources. These communities are already experiencing the effects of climate change, such as rising sea levels, more extreme weather events, and changes in precipitation patterns.\n\nThe [Title of Bill] would help these communities to prepare for and adapt to the impacts of climate change. The bill would provide funding for climate change planning, research, and adaptation projects. It would also create a new grant program to help communities develop climate change resilience plans.\n\nI urge you to support the [Title of Bill]. This bill would provide critical assistance to the United States Territories and Freely Associated States as they face the impacts of climate change.\n\nSincerely,\n[Your Name]", "hr3524-117": "Dear [Name of Member of Congress],\n\nI am writing to you today to express my support for the [Title of Bill]. This bill would revitalize and reassert United States leadership, investment, and engagement in the Indo-Pacific region and globally.\n\nThe United States has long been a leader in the Indo-Pacific region, and our engagement there is essential to maintaining peace and stability. However, in recent years, China has been increasingly assertive in the region, and the United States has been unable to effectively counter China's actions.\n\nThe [Title of Bill] would help to address this imbalance by providing funding for the United States military and diplomatic efforts in the Indo-Pacific region. It would also strengthen our alliances with key partners in the region, such as Japan, South Korea, and Australia.\n\nI urge you to support the [Title of Bill] and help to ensure that the United States remains a strong and engaged leader in the Indo-Pacific region.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]", "s3129-117": "The following is a template for public comments on the bill to amend the Wild and Scenic Rivers Act to designate certain segments of the Gila River system in the State of New Mexico as components of the National Wild and Scenic Rivers System, to provide for the transfer of administrative jurisdiction over certain Federal land in the State of New Mexico, and for other purposes.\n\nPlease include your name and address at the top of your comment.\n\nYou may submit your comments in writing or electronically. If you submit your comments in writing, please send them to:\n\n[Name of the appropriate government agency]\n[Address]\n\nIf you submit your comments electronically, please send them to:\n\n[Email address]\n\nYour comments should be as specific as possible. Please include your thoughts on the following:\n\n* The benefits of designating the Gila River system as a component of the National Wild and Scenic Rivers System.\n* The potential impacts of designating the Gila River system as a component of the National Wild and Scenic Rivers System.\n* Whether the transfer of administrative jurisdiction over certain Federal land in the State of New Mexico is appropriate.\n* Any other relevant information.\n\nYour comments will be considered by the government agency responsible for reviewing the bill. Thank you for your time and consideration.", "hr2794-117": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the Boundary Waters Canoe Area Wilderness Act of 2023. This bill would provide for the protection of the Boundary Waters Canoe Area Wilderness and interconnected Federal lands and waters, including Voyageurs National Park, within the Rainy River Watershed in the State of Minnesota.\n\nThe Boundary Waters Canoe Area Wilderness is a national treasure. It is a vast wilderness area that offers unparalleled opportunities for recreation, including canoeing, hiking, fishing, and camping. The Boundary Waters is also home to a rich diversity of wildlife, including moose, bears, wolves, and eagles.\n\nThe Boundary Waters is under threat from a number of proposed mining projects. These projects would pollute the waters of the Boundary Waters and destroy the wilderness character of the area. The Boundary Waters Canoe Area Wilderness Act of 2023 would protect the Boundary Waters from these threats by permanently prohibiting mining in the area.\n\nI urge you to support the Boundary Waters Canoe Area Wilderness Act of 2023. This bill would protect a national treasure and ensure that future generations can enjoy the Boundary Waters for generations to come.\n\nSincerely,\n[Your Name]", "hr1517-117": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the Mineral Leasing Act Amendments of 2023. This bill would make important reforms to the federal mineral leasing program, ensuring that taxpayers receive a fair return on the development of our nation's energy resources.\n\nThe current mineral leasing program is outdated and in need of reform. The royalty rates for fossil fuels are too low, and the program does not adequately account for the environmental impacts of development. This bill would address these issues by raising royalty rates, closing loopholes, and requiring more robust environmental reviews.\n\nThe reforms in this bill would generate billions of dollars in additional revenue for the federal government, which could be used to invest in clean energy and other important priorities. The bill would also help to ensure that the development of our nation's energy resources is done in a responsible manner that protects the environment.\n\nI urge you to support the Mineral Leasing Act Amendments of 2023. This bill is good for taxpayers, good for the environment, and good for our nation's energy future.\n\nSincerely,\n[Your Name]", "hr3326-117": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the bill to promote the development of renewable energy on public lands. I believe that this bill is a critical step in addressing the climate crisis and ensuring that our country has a clean energy future.\n\nRenewable energy is essential to reducing our reliance on fossil fuels and mitigating the effects of climate change. Solar and wind power are clean, renewable sources of energy that do not produce greenhouse gases. They are also becoming increasingly affordable, making them a cost-effective way to meet our energy needs.\n\nThe development of renewable energy on public lands can help us to meet our climate goals while also creating jobs and economic opportunity. Public lands are a vast resource that can be used to generate clean energy for our country. The development of renewable energy on public lands can also help to reduce our dependence on foreign oil and create jobs in rural communities.\n\nI urge you to support this bill and help to make it a reality. Thank you for your time and consideration.\n\nSincerely,\n[Your Name]", "hr1506-117": "Dear [Name of Member of Congress],\n\nI am writing to you today to express my support for the bill, \"To provide for the accurate reporting of fossil fuel extraction and emissions by entities with leases on public land, and for other purposes.\"\n\nI believe that this bill is essential to protecting our environment and public health. The fossil fuel industry has a long history of polluting our air and water, and it is clear that we need to take action to hold them accountable. This bill would do just that by requiring entities with leases on public land to accurately report their fossil fuel extraction and emissions.\n\nThis information is critical for us to understand the full impact of the fossil fuel industry on our planet. It will also help us to develop policies that can reduce emissions and protect our environment.\n\nI urge you to support this bill and help us to move towards a clean energy future.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]", "hr1884-117": "Dear [Name of Member of Congress],\n\nI am writing to you today to express my support for the repeal of section 3003 of the Carl Levin and Howard P. \"Buck\" McKeon National Defense Authorization Act for Fiscal Year 2015. This section of the law authorizes the use of military force against Iran without a declaration of war from Congress.\n\nI believe that the use of military force should only be authorized by Congress, as the Constitution gives it the sole power to declare war. I am concerned that section 3003 gives the President too much power to unilaterally decide to go to war with Iran.\n\nI urge you to support the repeal of section 3003 and to work to ensure that Congress has a say in any decision to use military force against Iran.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]", "s4542-117": "To the Committee on Natural Resources,\n\nI am writing to express my support for the bill to establish the Dolores River National Conservation Area and the Dolores River Special Management Area in the State of Colorado. This bill would protect a valuable natural resource and provide for the sustainable use of water in the state.\n\nThe Dolores River is a beautiful and important river that flows through Colorado. It is home to a variety of wildlife, including fish, birds, and mammals. The river is also a source of water for irrigation and drinking.\n\nThe bill would create two new protected areas along the Dolores River. The Dolores River National Conservation Area would be a wilderness area, while the Dolores River Special Management Area would allow for some limited development. This would protect the river's natural beauty and ensure that it continues to be a source of water for the people of Colorado.\n\nI urge you to support this bill and help to protect the Dolores River for future generations.\n\nSincerely,\n[Your Name]", "hr3772-117": "The United States House of Representatives and the United States Senate do enact as follows:\n\n**Section 1. Short title**\n\nThis Act may be cited as the “Homelessness Reduction Act of 2023”.\n\n**Sec. 2. Findings**\n\nCongress finds the following:\n\n(1) Homelessness is a serious problem in the United States. In 2020, an estimated 567,715 people were experiencing homelessness on a single night in the United States.\n\n(2) Homelessness is a complex problem with many causes, including poverty, lack of affordable housing, mental illness, and substance abuse.\n\n(3) Homelessness has a devastating impact on individuals, families, and communities. People who are homeless are more likely to experience health problems, violence, and crime. They are also more likely to be unemployed and have low incomes.\n\n(4) The United States government has a responsibility to address the problem of homelessness.\n\n**Sec. 3. Purposes**\n\nThe purposes of this Act are to—\n\n(1) address the root causes of homelessness;\n\n(2) meet the needs of community members experiencing harms from homelessness;\n\n(3) transition communities towards providing housing for all;\n\n(4) end the penalization of homelessness; and\n\n(5) ensure full democratic participation and inclusion of persons experiencing homelessness.\n\n**Sec. 4. Definitions**\n\nIn this Act:\n\n(1) The term “community” means a city, county, town, village, or other political subdivision of a State.\n\n(2) The term “homelessness” means the condition of lacking a fixed, regular, and adequate nighttime residence.\n\n(3) The term “person experiencing homelessness” means an individual who is homeless.\n\n**Sec. 5. Addressing root causes of homelessness**\n\n(a) In general\n\nThe Secretary of Housing and Urban Development (referred to in this section as the “Secretary”) shall develop a plan to address the root causes of homelessness.\n\n(b) Plan elements\n\nThe plan developed under subsection (a) shall include—\n\n(1) strategies to increase the supply of affordable housing;\n\n(2) strategies to address poverty and economic inequality;\n\n(3) strategies to address mental illness and substance abuse;\n\n(4) strategies to improve access to", "hr7900-117": "The following is a public commenting template for the bill titled \"To authorize appropriations for fiscal year 2023 for military activities of the Department of Defense and for military construction, to prescribe military personnel strengths for such fiscal year, and for other purposes.\"\n\n**To the Honorable Members of the United States House of Representatives:**\n\nI am writing to express my support for the bill titled \"To authorize appropriations for fiscal year 2023 for military activities of the Department of Defense and for military construction, to prescribe military personnel strengths for such fiscal year, and for other purposes.\"\n\nI believe that this bill is essential to ensuring the safety and security of our nation. The United States faces a number of threats from both near-peer adversaries and terrorist organizations. This bill will provide the resources necessary to maintain our military readiness and to deter aggression.\n\nI am particularly supportive of the provisions in this bill that would increase funding for research and development of new technologies. These technologies are essential to maintaining our military edge in the 21st century.\n\nI urge you to support this bill and to ensure that it is passed into law.\n\nThank you for your time and consideration.\n\nSincerely,\n\n[Your Name]", "hr4270-117": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the Abandoned Well Remediation Act of 2023. This bill would direct the Secretary of Energy to carry out a research, development, and demonstration program with respect to abandoned wells.\n\nAbandoned wells are a serious environmental problem. They can leak methane and other harmful pollutants into the environment, contaminate groundwater, and pose a risk to public health and safety. The Abandoned Well Remediation Act would help to address this problem by providing funding for research and development of new technologies to remediate abandoned wells.\n\nI urge you to support the Abandoned Well Remediation Act of 2023. This bill would make a significant contribution to protecting our environment and public health.\n\nSincerely,\n[Your Name]", "hr8802-117": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the bill, To require the Secretary of the Interior and the Chief of the Forest Service to align management of public lands and waters with the President's greenhouse gas emission reduction goals, and for other purposes.\n\nI believe that this bill is an important step in addressing the climate crisis. Public lands and waters play a vital role in sequestering carbon and mitigating climate change, and this bill would ensure that they are managed in a way that maximizes their climate benefits.\n\nSpecifically, I support the provisions of this bill that would require the Secretary of the Interior and the Chief of the Forest Service to:\n\n* Develop a plan to reduce greenhouse gas emissions from public lands and waters by 50% by 2030 and to net-zero by 2050;\n* Take steps to increase the carbon storage capacity of public lands and waters;\n* Protect and restore forests and wetlands, which are important carbon sinks;\n* Promote renewable energy development on public lands and waters;\n* Reduce the use of fossil fuels on public lands and waters; and\n* Take other steps to reduce greenhouse gas emissions.\n\nI believe that this bill would make a significant contribution to the fight against climate change, and I urge you to support it.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]", "s1321-117": "The following is a public comment template for the bill \"A bill to modify the boundary of the Casa Grande Ruins National Monument, and for other purposes.\"\n\nTo the Senate and House of Representatives of the United States of America:\n\nI am writing to express my support for the bill \"A bill to modify the boundary of the Casa Grande Ruins National Monument, and for other purposes.\"\n\nThe Casa Grande Ruins National Monument is a significant archaeological site that is home to the remains of a Hohokam pueblo that was built over 800 years ago. The monument is a valuable resource for understanding the history and culture of the Hohokam people, and it is also a popular tourist destination.\n\nThe bill would modify the boundary of the monument to include an additional 1,200 acres of land. This land is important for protecting the monument from development and for providing additional opportunities for research and interpretation.\n\nI urge you to support this bill and to help ensure that the Casa Grande Ruins National Monument is protected for future generations.\n\nSincerely,\n[Your Name]"}