{"hr6064-118": "Dear [Name of Member of Congress],\n\nI am writing to express my support for [Title of Bill]. This bill would amend the Federal Land Policy and Management Act of 1976 to provide for the denial of certain applications for solar or wind energy development projects right-of-way applications.\n\nI believe that this bill is necessary to protect our public lands from the harmful effects of solar and wind energy development. Solar and wind farms can have a significant impact on the environment, including by harming wildlife, destroying habitat, and polluting the air and water. I am concerned that the current law does not adequately protect our public lands from these harmful effects.\n\nThis bill would provide for the denial of right-of-way applications for solar or wind energy development projects that would have a significant negative impact on the environment. This would help to ensure that our public lands are protected from the harmful effects of solar and wind energy development.\n\nI urge you to support [Title of Bill]. Thank you for your time and consideration.\n\nSincerely,\n[Your Name]", "s3122-118": "To amend the Federal Land Policy and Management Act of 1976 to provide for the denial of certain applications for solar or wind energy development projects right-of-way applications.\n\nThe following is a public comment template for the above bill:\n\nDear [Name of Member of Congress],\n\nI am writing to you today to express my support for the bill to amend the Federal Land Policy and Management Act of 1976 to provide for the denial of certain applications for solar or wind energy development projects right-of-way applications.\n\nI believe that this bill is necessary to protect our public lands from the harmful effects of solar and wind energy development. Solar and wind farms can have a devastating impact on the environment, including by destroying wildlife habitat, polluting the air and water, and contributing to climate change.\n\nI urge you to support this bill and help to protect our public lands for future generations.\n\nSincerely,\n[Your Name]", "s3026-118": "To amend the Inflation Reduction Act of 2022 to repeal restrictions on offshore wind leasing.\n\nBe it enacted by the Senate and House of Representatives of the United States of America in Congress assembled,\n\nSection 1. Short title\n\nThis Act may be cited as the “Offshore Wind Leasing Repeal Act of 2022”.\n\nSec. 2. Findings\n\nCongress finds the following:\n\n(1) The United States has the potential to be a global leader in the development of offshore wind energy.\n\n(2) Offshore wind energy can help to reduce greenhouse gas emissions and create jobs in the United States.\n\n(3) The current restrictions on offshore wind leasing are impeding the development of offshore wind energy in the United States.\n\n(4) Repealing the current restrictions on offshore wind leasing would help to promote the development of offshore wind energy in the United States.\n\nSec. 3. Repeal of restrictions on offshore wind leasing\n\n(a) In general\n\nThe Inflation Reduction Act of 2022 is amended--\n\n(1) in section 101(a)(1)(A), by striking ``(A) in general'' and inserting the following:``(A) in general.--Except as provided in subparagraph (B),''; and\n\n(2) by adding at the end the following:``(B) Exception for offshore wind energy.--The Secretary shall not impose any restriction on the leasing of offshore areas for the purpose of developing offshore wind energy.''.\n\nSec. 4. Authorization of appropriations\n\nThere are authorized to be appropriated such sums as may be necessary to carry out this Act.", "s3025-118": "To amend the Inflation Reduction Act of 2022 to repeal restrictions on onshore wind and solar.\n\nBe it enacted by the Senate and House of Representatives of the United States of America in Congress assembled,\n\nSection 1. Short title\n\nThis Act may be cited as the “Repeal of Restrictions on Onshore Wind and Solar Act of 2023”.\n\nSec. 2. Findings\n\nCongress finds the following:\n\n(1) The United States has a long history of leadership in the development of renewable energy technologies.\n\n(2) Onshore wind and solar power are two of the most cost-effective and reliable sources of renewable energy available.\n\n(3) The current restrictions on onshore wind and solar development are unnecessary and counterproductive.\n\n(4) Repealing these restrictions would create jobs, boost economic growth, and help the United States achieve its climate goals.\n\nSec. 3. Repeal of restrictions\n\n(a) In general\n\nThe Inflation Reduction Act of 2022 is amended--\n\n(1) in section 101(a)(1)(A), by striking ``and'' at the end;\n\n(2) in section 101(a)(1)(B), by striking the period at the end and inserting ``; and''; and\n\n(3) by adding at the end the following new paragraph:\n\n``(C) onshore wind and solar power facilities.''.\n\n(b) Conforming amendment\n\nSection 102(a) of the Inflation Reduction Act of 2022 is amended by striking ``and'' at the end of paragraph (1), by striking the period at the end of paragraph (2) and inserting ``; and'', and by adding at the end the following new paragraph:\n\n``(3) onshore wind and solar power facilities.''.\n\nSec. 4. Authorization of appropriations\n\nThere are authorized to be appropriated such sums as may be necessary to carry out this Act.", "hr4916-118": "Dear [Name of Member of Congress],\n\nI am writing to you today to express my support for the bill to amend the Inflation Reduction Act of 2022 to repeal restrictions on onshore wind and solar.\n\nI believe that this bill is a commonsense measure that will help to reduce our dependence on foreign oil, create jobs, and combat climate change.\n\nOnshore wind and solar power are clean, renewable sources of energy that do not produce greenhouse gases. They are also becoming increasingly affordable. In fact, the cost of solar energy has fallen by 80% in the past decade.\n\nBy repealing the restrictions on onshore wind and solar, we can create jobs, boost our economy, and reduce our dependence on foreign oil. We can also help to combat climate change by taking action to reduce our greenhouse gas emissions.\n\nI urge you to support this bill and help to make it a reality.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]", "hr4936-118": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the To amend the Inflation Reduction Act of 2022 to repeal restrictions on offshore wind leasing.\n\nOffshore wind is a clean, renewable energy source that can help us reduce our reliance on fossil fuels and combat climate change. The United States has a vast offshore wind resource, and developing this resource could create jobs, boost the economy, and help us achieve our climate goals.\n\nThe Inflation Reduction Act of 2022 included a provision that would restrict offshore wind leasing in the Atlantic Ocean. This provision is unnecessary and counterproductive. It would prevent the United States from developing a clean, renewable energy source that could help us reduce our reliance on fossil fuels and combat climate change.\n\nI urge you to support the To amend the Inflation Reduction Act of 2022 to repeal restrictions on offshore wind leasing. This legislation would help us create jobs, boost the economy, and protect our planet.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]", "hr4284-118": "Dear [Name of Member of Congress],\n\nI am writing to express my strong opposition to H.R. 831, the \"Gulf of Maine Lobster Management Area 1 Moratorium Act of 2023.\" This bill would prohibit commercial offshore wind energy development in Lobster Management Area 1 in the Gulf of Maine, which would have a devastating impact on the local economy and environment.\n\nThe Gulf of Maine is a vital fishing area for the state of Maine, and lobster is one of the state's most important exports. Commercial offshore wind energy development would threaten this important industry by disrupting lobster fishing grounds and harming lobster populations.\n\nIn addition, offshore wind energy development would have a negative impact on the environment. Offshore wind turbines can harm marine life, and they can also contribute to climate change by emitting greenhouse gases.\n\nI urge you to vote against H.R. 831. This bill would be a disaster for the state of Maine and for the environment.\n\nSincerely,\n[Your Name]", "hr4151-118": "Dear [Name of Member of Congress],\n\nI am writing to express my support for H.R. [Bill Number], a bill to amend the Internal Revenue Code of 1986 to require certain contract terms in contracts relating to wind turbines on land not owned by the taxpayer as a requirement in order to claim the credit relating to electricity produced from certain renewable resources.\n\nI believe that this bill is a commonsense measure that would help to promote the development of renewable energy sources in the United States. By requiring certain contract terms in contracts relating to wind turbines on land not owned by the taxpayer, this bill would help to ensure that these projects are developed in a way that is consistent with the interests of local communities.\n\nSpecifically, this bill would require that contracts for wind turbines on land not owned by the taxpayer include a provision that allows the landowner to terminate the contract if the wind turbine does not generate a certain amount of electricity. This provision would help to protect landowners from the risk that a wind turbine project may not be successful, and it would also help to ensure that wind turbines are sited in a way that does not interfere with other land uses.\n\nI urge you to support H.R. [Bill Number] and help to make it law. Thank you for your time and consideration.\n\nSincerely,\n[Your Name]", "hr3614-118": "Dear [Name of Member of Congress],\n\nI am writing to you today to express my support for the Offshore Wind Development Vessels Act of 2023. This bill would direct the Comptroller General of the United States to submit to Congress a report on the feasibility of using offshore wind development vessels to construct offshore wind farms.\n\nOffshore wind power is a clean, renewable energy source that has the potential to provide significant benefits to the United States. However, the development of offshore wind farms is currently limited by the high cost of construction. Offshore wind development vessels could help to reduce the cost of construction by providing a more efficient and cost-effective way to transport and install wind turbines.\n\nThe Comptroller General's report would provide valuable information on the feasibility of using offshore wind development vessels. This information would be helpful to policymakers as they consider ways to promote the development of offshore wind power in the United States.\n\nI urge you to support the Offshore Wind Development Vessels Act of 2023. Thank you for your time and consideration.\n\nSincerely,\n[Your Name]", "hr2716-118": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the Offshore Wind Revenue Distribution Act of 2023. This bill would distribute revenue from offshore wind projects in the New York Bight Area to certain coastal States, and promote conservation and workforce development.\n\nI believe that this bill is a win-win for coastal communities and the environment. Offshore wind development has the potential to create jobs, boost the economy, and reduce our reliance on fossil fuels. By distributing revenue from these projects to coastal States, this bill would help to ensure that these benefits are shared equitably.\n\nIn addition, the bill would provide funding for conservation and workforce development programs. These programs would help to protect our coastal environment and ensure that workers have the skills they need to participate in the offshore wind industry.\n\nI urge you to support the Offshore Wind Revenue Distribution Act of 2023. This bill is a critical step towards building a clean energy future for our country.\n\nSincerely,\n[Your Name]", "hres239-118": "To the Honorable Members of the House of Representatives:\n\nI am writing to express my support for the bill, \"Expressing the sense of the House of Representatives that offshore wind projects along the Atlantic coast require more comprehensive investigations examining the impact to the environment, relevant maritime industries, and national defense before being leased or constructed.\"\n\nOffshore wind power has the potential to be a major source of clean energy for the United States, but it is important to ensure that these projects are developed in a way that does not harm the environment or other important interests. This bill would require more comprehensive investigations of the potential impacts of offshore wind projects, which would help to ensure that they are developed in a responsible manner.\n\nI urge you to support this bill and help to ensure that offshore wind power is developed in a way that benefits all Americans.\n\nSincerely,\n[Your Name]", "hr982-118": "Dear [Name of Representative],\n\nI am writing to express my support for the bill to address the health needs of incarcerated women related to pregnancy and childbirth.\n\nIncarcerated women are a vulnerable population who face a number of health risks, including pregnancy complications, postpartum depression, and sexually transmitted infections. This bill would provide much-needed funding for programs that address these health needs, and would ensure that incarcerated women have access to quality healthcare.\n\nI urge you to support this bill and help to improve the health of incarcerated women.\n\nSincerely,\n[Your Name]", "hr426-118": "Dear [Name of Member of Congress],\n\nI am writing to express my opposition to H.R. [bill number], a bill to amend the Internal Revenue Code of 1986 to end the investment tax credit for offshore wind facilities in the inland navigable waters of the United States.\n\nOffshore wind energy is a clean, renewable source of energy that can help us reduce our reliance on fossil fuels and combat climate change. The investment tax credit is an important incentive that has helped to make offshore wind energy projects more affordable. Ending the investment tax credit would make it more difficult to develop offshore wind projects in the United States, and would ultimately lead to higher energy costs for consumers.\n\nI urge you to vote against H.R. [bill number]. Thank you for your time and consideration.\n\nSincerely,\n[Your Name]", "hr4690-117": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the reauthorization and amendment of the Magnuson-Stevens Fishery Conservation and Management Act (MSA). The MSA is the nation's primary law governing fisheries management, and it has been instrumental in ensuring the sustainability of our fisheries resources.\n\nThe MSA has a number of key provisions that need to be reauthorized and amended, including:\n\n* The establishment of a new national ocean policy that will promote sustainable fisheries management and ocean conservation.\n* The development of a new fisheries management plan for the Gulf of Mexico that will address the challenges facing the region's fisheries.\n* The implementation of new measures to reduce bycatch and protect marine mammals.\n\nI urge you to support the reauthorization and amendment of the MSA. These important changes will help to ensure the sustainability of our fisheries resources for generations to come.\n\nSincerely,\n[Your Name]", "hr2780-117": "Dear [Name of Member of Congress],\n\nI am writing to you today to express my support for the [Title of Bill]. This bill would provide much-needed funding and resources for climate change planning, mitigation, adaptation, and resilience in the United States Territories and Freely Associated States.\n\nThe United States Territories and Freely Associated States are particularly vulnerable to the impacts of climate change. They are located in some of the most climate-sensitive areas in the world, and they have limited resources to adapt to the changing climate.\n\nThe [Title of Bill] would provide funding for a variety of climate change mitigation and adaptation projects in the United States Territories and Freely Associated States. These projects would help to reduce greenhouse gas emissions, build resilience to climate change impacts, and protect the people and ecosystems of these vulnerable regions.\n\nI urge you to support the [Title of Bill] and help to ensure that the United States Territories and Freely Associated States are prepared for the impacts of climate change.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]", "hr3764-117": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the Ocean Climate Solutions Act of 2023. This bill would take important steps to address the climate crisis by investing in ocean-based climate solutions, making coastal communities more resilient, and conserving and restoring ocean and coastal habitats.\n\nThe ocean is a critical part of the climate system, and it is already being impacted by climate change. Rising sea levels, ocean acidification, and changes in ocean circulation are all having a negative impact on marine ecosystems and coastal communities. The Ocean Climate Solutions Act would help to address these challenges by investing in research and development of ocean-based climate solutions, such as offshore wind power and carbon capture and storage. The bill would also provide funding for coastal resilience projects, such as seawalls and levees, to help protect communities from the impacts of climate change.\n\nIn addition to addressing the climate crisis, the Ocean Climate Solutions Act would also help to conserve and restore ocean and coastal habitats. The bill would provide funding for marine protected areas, oyster reefs, and other projects that help to protect and restore ocean ecosystems. These investments would benefit not only marine life, but also coastal communities, which rely on healthy oceans for food, jobs, and recreation.\n\nI urge you to support the Ocean Climate Solutions Act of 2023. This bill would take important steps to address the climate crisis and protect our ocean and coastal communities.\n\nSincerely,\n[Your Name]", "hr3524-117": "Dear [Name of Member of Congress],\n\nI am writing to you today to express my support for the [Title of Bill]. This bill would revitalize and reassert United States leadership, investment, and engagement in the Indo-Pacific region and globally.\n\nThe United States has a long history of engagement in the Indo-Pacific region. We have strong economic, security, and cultural ties with the countries in this region. The Indo-Pacific is also a vitally important region for global trade and security.\n\nIn recent years, China has been increasingly assertive in the Indo-Pacific region. It has built up its military, asserted its territorial claims, and sought to undermine the rules-based order. This has created a challenge to the United States' interests in the region.\n\nThe [Title of Bill] would help the United States meet this challenge. The bill would provide funding for the United States military, economic, and diplomatic efforts in the Indo-Pacific region. It would also strengthen our alliances with our partners in the region.\n\nI urge you to support the [Title of Bill]. This bill is essential for the United States to maintain its leadership, investment, and engagement in the Indo-Pacific region and globally.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]", "hr7776-117": "Dear [Member of Congress],\n\nI am writing to express my support for the [bill title]. This bill would provide much-needed funding for improvements to the rivers and harbors of the United States, as well as for the conservation and development of water and related resources.\n\nThe United States has a vast network of rivers and harbors that are essential to our economy and way of life. These waterways provide transportation for goods and people, support recreation and tourism, and are home to a variety of wildlife. However, many of our rivers and harbors are in need of repair and maintenance. The [bill title] would provide the funding necessary to make these improvements, which would create jobs and boost the economy.\n\nIn addition to funding improvements to our waterways, the [bill title] would also provide funding for the conservation and development of water and related resources. This funding would be used to protect our water quality, restore wetlands, and promote water conservation. These investments are critical to ensuring that we have a clean and reliable water supply for the future.\n\nI urge you to support the [bill title]. This bill would make a real difference in the lives of Americans and would help to protect our environment for generations to come.\n\nSincerely,\n[Your name]", "s4237-117": "Dear [Name of Member of Congress],\n\nI am writing to express my support for the Wildfire Mitigation and Smoke Forecasting Act of 2023. This bill would establish and maintain a coordinated program within the National Oceanic and Atmospheric Administration (NOAA) that improves wildfire, fire weather, fire risk, and smoke related forecasting, detection, modeling, observations, and service delivery.\n\nWildfires are a growing threat to our communities, and the need for better wildfire mitigation and smoke forecasting is urgent. This bill would help NOAA to better meet the needs of our communities by providing them with the information they need to stay safe and informed.\n\nI urge you to support the Wildfire Mitigation and Smoke Forecasting Act of 2023.\n\nSincerely,\n[Your Name]"}